[
  {
    "id": "FNA_LADD",
    "source": "FNA",
    "name": "Ladd",
    "mechtype": [
      "Support"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "<p>Fnet engineers have managed to recover and rebuilds a IPS-N Ladd frame, however, seeing its possibilty to deploy troops to the battlefield, they decided to keep the frame the same, with a few alterations.</p>",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 2,
      "hp": 6,
      "evasion": 6,
      "edef": 12,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 6,
      "sp": 10
    },
    "traits": [
      {
        "name": "Rapid Deployment",
        "description": "On its first turn in any combat scene, the Ladd can deploy or activate any one system with the drone or deployable tag as a free action.",
        "synergies": [
          {
            "locations": [
              "deployable",
              "drone"
            ],
            "detail": "On its first turn in any combat, the Ladd can deploy or activate any one system with the DRONE or DEPLOYABLE tag as a free action."
          }
        ]
      },
      {
        "name": "Reroute Power",
        "description": "As a quick action 1/round, the Ladd can destroy one of its DEPLOYABLES or DRONES that was not deployed or created in the same round to either grant 1d6+1 OVERSHIELD to an allied character or deal 1d6+1 AP Energy Damage to a hostile character. The target, allied or hostile, must be adjacent to whatever is destroyed. Systems without LIMITED that are destroyed this way must be repaired before they can be used again.",
        "actions": [
          {
            "name": "Reroute Power",
            "activation": "Quick",
            "frequency": "1/round",
            "detail": "Destroy one of your deployables or drones to either grant 1d6+1 OVERSHIELD to an allied character or deal 1d6+1 AP Energy Damage to a hostile character. The target, allied or hostile, must be adjacent to whatever is destroyed. Systems without LIMITED that are destroyed this way must be repaired before they can be used again."
          }
        ]
      },
      {
        "name": "Recycle",
        "description": "At the end of any scene in which the Ladd used REROUTE POWER, it restores 1 charge to a LIMITED system of its choice with the DRONE or DEPLOYABLE tag.",
        "synergies": [
          {
            "locations": [
              "deployable",
              "drone"
            ],
            "detail": "At the end of any scene in which the Ladd used REROUTE POWER, it restores 1 charge to a LIMITED system of its choice with the DRONE or DEPLOYABLE tag."
          }
        ]
      }
    ],
    "core_system": {
      "name": "The Black Flag",
      "description": "",
      "active_name": "Skull and Bones",
      "active_effect": "For the rest of the scene, Plunder and Swindle become Blast 2 and Shiver Timbers affects all characters in a Line 10 path.",
      "activation": "Protocol",
      "use": "Encounter",
      "passive_name": "Black Flag",
      "passive_effect": "<p>At the start of every combat scene, your Ladd automatically connects to its paired Black Flag orbital satellite weapon. The efficacy of the Black Flag depends on maintaining a high level of calibration with the Ladd, which is tracked with a Black Flag DIE - 1d6, starting at 1.</p> <p>The die ticks up by 1 whenever you:</p> <ul> <li>deploy a DRONE or DEPLOYABLE</li> <li>take a tech action that targets at least one allied character.</li> </ul> <p>Each option can only increase the value of the of the Black Flag DIE once per round independently; however, the die also ticks up by 1 any time a hostile character takes a tech action against an allied character within your SENSORS, with no limit.</p> <p>1/round, you can activate the Black Flag as a quick action, resetting the Black Flag DIE to 1. Choose one of the following effects, based on the value of the die:</p> <p><b class='accent--text'>3+</b> <b>Plunder</b>: SCAN every hostile character in a Blast 1 area and give them LOCK ON.</p> <p><b class='accent--text'>5+</b> <b>Swindle</b>: Every hostile character in a Blast 1 area must succeed on a SYSTEMS save or become IMPAIRED, JAMMED, and SLOWED until the end of their next turn.</p> <p><b class='accent--text'>6</b> <b>Shiver Timbers</b>: Fire a beam weapon, punching a narrow hole through walls and obstructions. One hostile character must succeed on an AGILITY save or take 3d6 AP Energy Damage. On a success, they take half damage</p> <p>You do not require line of sight for any of these effects, they have the effective range of the battlefield, and they easily penetrate objects and terrain, although more potent barriers (e.g., energy shields that prevent effects from crossing them due to line of sight) block them normally</p>",
      "passive_actions": [
        {
          "name": "Plunder 3+",
          "activation": "Quick",
          "detail": "SCAN every hostile character in a Blast 1 area and give them LOCK ON.",
          "frequency": "1/round"
        },
        {
          "name": "Swindle 5+",
          "activation": "Quick",
          "detail": "Every hostile character in a Blast 1 area must succeed on a SYSTEMS save or become IMPAIRED, JAMMED, and SLOWED until the end of their next turn.",
          "frequency": "1/round"
        },
        {
          "name": "Shiver Timbers 6",
          "activation": "Quick",
          "detail": "Fire a beam weapon, punching a narrow hole through walls and obstructions. One hostile character must succeed on an AGILITY save or take 3d6 AP Energy Damage. On a success, they take half damage.",
          "frequency": "1/round"
        }
      ],
      "counters": [
        {
          "id": "ctr_jolly_roger",
          "name": "Black Flag",
          "default_value": 1,
          "min": 1,
          "max": 6
        }
      ]
    },
    "data_type": "frame",
    "image_url": "https://raw.githubusercontent.com/ppigmans/Fields-network-fab-guide/main/images%20for%20mechs/Ladd.png",
    "license_id": "FNA_LADD"
  }
]