[
  {
    "id": "FNA_ID10T",
    "name": "ID10T",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "FNA",
    "license": "Ladd",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick Tech",
        "detail": "<p>: An allied mech character within line of sight and SENSORS quickly flash reboots at the system level. This ends all effects caused by tech actions, stops NHP cascades, and gives the target Immunity to all tech actions – hostile and allied – other than this one until the end of their next turn. This cannot be used on Jammed characters.</p> <p>Additionally, roll 1d6 to determine a side effect from the table below. These effects take place immediately and don&rsquo;t count as an action or reaction. Any movement they cause is involuntary.</p> <ol> <li>Your target becomes JAMMED until the end of their next turn.</li> <li>Your target moves up to its SPEED in a direction of the GM&rsquo;s choice.</li> <li>Your target immediately moves up to 3 spaces toward the nearest character (allied or hostile) and performs an IMPROVISED ATTACK against them. If no characters are in range, it only moves.</li> <li>Your target falls PRONE and takes 2 Kinetic Damage.</li> <li>Your target vents 1d6 Heat and deals the amount cooled as energy damage to all adjacent characters.</li> <li>Your target immediately takes the STABILIZE action and can choose what to do.</li> </ol>"
      }
    ],
    "description": "When a problem exists due to the user's stupidity, the HORUS group would call them a ID10T, or ID ten TANGO.",
    "data_type": "system",
    "aptitude": {},
    "license_id": "FNA_:ADD"
  },
  {
    "id": "FNA_ALPHA_PLATE",
    "name": "Alpha Plate",
    "type": "Deployable",
    "sp": 1,
    "tags": [
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "FNA",
    "license": "Ladd",
    "license_level": 2,
    "effect": "Expend a charge to deploy an alpha plate to a space within Range 5.",
    "deployables": [
      {
        "name": "Alpha Plate",
        "type": "Deployable",
        "activation": "Quick",
        "instances": 1,
        "size": 1,
        "hp": 10,
        "evasion": 5,
        "detail": "The plate cannot be moved, is flat, and does not block movement. It is large enough to hold a single SIZE 1 or smaller DRONE or DEPLOYABLE at a time. DRONES and DEPLOYABLES placed on the plate gain RESISTANCE to all damage and gain +1 to the size of any BURST or BLAST effects they generate. Additionally, any of their effects that require adjacency can now be activated from within Range 2."
      }
    ],
    "description": "Northstar Branch Robotics returned to their roots with the Omnibus Plate, FNET stole this idea, Alpha Plates can attach securely to any drone or deployable system, increasing that system’s efficacy in all aspects of employ.",
    "data_type": "system",
    "aptitude": {},
    "license_id": "FNA_LADD"
  },
  {
    "id": "FNA_FIELD_ENGINEERING",
    "name": "Field Engineering Modifications",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "FNA",
    "license": "Ladd",
    "license_level": 2,
    "actions": [
      {
        "activation": "Quick Tech",
        "detail": "<p>Choose an allied mech character within line of sight and SENSORS. You power up their weapons. When they make a ranged or melee attack roll:</p> <ul> <li>the attack&rsquo;s damage cannot be reduced in any way</li> <li>the kick from firing the weapon knocks them back 1 space in any direction after the attack</li> <li><strong>On Hit:</strong> their target must succeed on a HULL save or be knocked PRONE.</li> </ul> <p>This effect ends when your target successfully hits with a ranged or melee attack roll or at the end of the scene.</p>"
      }
    ],
    "description": "As implied by the name, FEM modifications are ad hoc battlefield modifications that, while technically falling well outside the approved envelope of functionality and safety, are nonetheless popular among veteran pilots. FEM mods tend to be temporary in nature: removal of joule governors with quick-patched code, fieldcooked “hot” kinetic rounds, and so on.",
    "data_type": "system",
    "aptitude": {},
    "license_id": "FNA_LADD"
  },
  {
    "id": "ms_forge_2_subaltern_squad",
    "name": "FORGE-2 Subaltern Squad",
    "type": "Deployable",
    "sp": 4,
    "tags": [
      {
        "id": "tg_limited",
        "val": 6
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IPS-N",
    "license": "Kidd",
    "license_level": 3,
    "effect": "<p>1/round, expend a charge to deploy a team of FORGE-2 subalterns to start work on one of the following projects in a free space within line of sight and Range 5.</p> <p>The project is an immovable object that is finished at the start of your next turn, gaining +10 HP (maximum and current). It is canceled if it&rsquo;s destroyed.</p> <p>The subalterns aren&rsquo;t treated as separate entities and can&rsquo;t be targeted. They return to you if the project is destroyed, canceled, or finished, no matter where you are.</p> <p>If you OVERCHARGE to use this system again, it may ignore the 1/round limit, but the second project must be placed adjacent to the first.</p>",
    "deployables": [
      {
        "type": "Project",
        "name": "Emplacement",
        "activation": "Quick",
        "instances": 1,
        "cost": 1,
        "size": 1,
        "hp": 5,
        "detail": "When finished, this elevated emplacement is SIZE 1 and 3 spaces high. The top third is a is a shielded platform that can fit characters up to a combined SIZE 1 (the rest is solid metal or plastic). Firing slits allow line of sight both into and out of the emplacement but give characters within hard cover from all directions. Characters can enter or exit the emplacement from any adjacent space as a quick action. Upon entering, they move into the shielded platform. Characters and DEPLOYABLES can stand on the flat roof of the structure, but don’t gain cover."
      },
      {
        "type": "Project",
        "name": "Snare Foam",
        "activation": "Quick",
        "instances": 1,
        "cost": 1,
        "size": 1,
        "hp": 5,
        "detail": "When finished, this project continually sprays foam around it, creating a Burst 2 area of difficult terrain. Destroying it removes the effect."
      },
      {
        "type": "Project",
        "name": "Damping Station",
        "activation": "Quick",
        "instances": 1,
        "cost": 1,
        "size": 1,
        "hp": 5,
        "detail": "When finished, this repair station generates a Burst 1 field within which allied characters gain IMMUNITY to burn and clear any burn currently them."
      },
      {
        "type": "Project",
        "name": "Armor Pack",
        "activation": "Quick",
        "instances": 1,
        "cost": 1,
        "size": 1,
        "hp": 5,
        "detail": "When finished, this pack latches onto the next allied character that moves adjacent to it and fuses onto them. The project is destroyed, but they gain +1 ARMOR for the rest of the scene. This could temporarily put them over the armor maximum."
      }
    ],
    "description": "The FORGE line of subalterns represents IPS-N’s premier range of frontline autonomous robotic humanoids. Produced by its robotics division, Northstar Branch Robotics, FORGE-2 subalterns are IPS-N’s newest combat engineering models, built to user scale and function.",
    "data_type": "system",
    "aptitude": {},
    "license_id": "mf_kidd"
  },
  {
    "id": "ms_smokestack_heatsink",
    "name": "SMOKESTACK Heat Sink",
    "type": "Deployable",
    "sp": 3,
    "tags": [
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IPS-N",
    "license": "Kidd",
    "license_level": 3,
    "deployables": [
      {
        "name": "SMOKESTACK Heat Sink",
        "type": "Pylon",
        "activation": "Quick",
        "instances": 1,
        "size": 0.5,
        "hp": 5,
        "evasion": 10,
        "edef": 10,
        "heat": 6,
        "detail": "Expend a charge to deploy a pylon that absorbs heat in a Burst 2 area around itself. It absorbs any heat dealt to characters at least partially within the affected area from any source (before reductions, including RESISTANCE). Once the pylon has absorbed 6 Heat, it explodes. Characters within the affected area must succeed on an AGILITY save or take 1d6+3 AP Energy Damage. On a success, they take half damage. Objects and DEPLOYABLES are hit automatically. Any excess heat absorbed by the pylon as part of the same action or effect that caused it to explode disperses with no effect."
      }
    ],
    "description": "The IPS-N Kidd’s SMOKESTACK Heat Sink represents the latest in IPS-N’s heat dispersion systems for chassis and other CORE-powered vehicles and vessels. Utilizing proprietary axiomatics, the SMOKESTACK system establishes (via deployable pylon) a localized, minor, and stable pinhole into an omega state, allowing users to – for a certain value of thermodynamic exchange – cool excess heat debt by depositing it into that same state. Once the SMOKESTACK reaches capacity – a hard-coded feature – it detonates, making the system just as effective a weapon as it is a heat sink.",
    "data_type": "system",
    "aptitude": {},
    "license_id": "mf_kidd"
  }
]