[
  {
    "id": "FN_",
    "name": "FIELDS NETWORK",
    "light": "#1A1A51",
    "dark": "#9696FF",
    "logo_url": "https://raw.githubusercontent.com/ppigmans/Fields-network-fab-guide/main/Logos/FNET.svg",
    "quote": "<div>Fields Network - Reconstructing what was lost</div>",
    "description": "<div>Fields Network (FNET) is a mech manufacturer that specializes in rebuilding mechs from a war that was fought long ago. The company was founded by a group of engineers and scientists who were determined to preserve the technology of the mechs for future generations. FNET's mechs are rebuilt using the original blueprints and materials, and they are equipped with the latest in weapons and technology.</div><div>The mechs that FNET rebuilds are not just museum pieces. They are fully functional and can be used for a variety of purposes, such as peacekeeping, disaster relief, and even combat. FNET's mechs have been used to help stabilize regions after conflict, to rescue people from natural disasters, and to fight against terrorism.</div>"
  },
  {
    "id": "KM",
    "name": "Knightly Manufacturing",
    "light": "#106B68",
    "dark": "#0D948F",
    "logo_url": "https://raw.githubusercontent.com/ppigmans/Fields-network-fab-guide/main/Logos/FNET-KM.svg",
    "quote": "<div>Let justice be done through the heavens fall.</div>",
    "description": "<div>Once a small time mech manufacturer, focussed on building civilian mechs, they got bought up by FNET, however, the entire staff of the original Knightly manufacturing got layed off, and the modern version of KM was born, a company which had its new origin stained with blood.<br><br>Not much is known about the modern KM, except that it acts as a private military corporation for FNET.</div>"
  },
  {
    "id": "GES",
    "name": "GENERAL EXPERIMENTAL SYSTEMS",
    "light": "#004707",
    "dark": "#22922D",
    "logo_url": "https://raw.githubusercontent.com/massif-press/compcon/89df87bdb327fb901aa7200c84fb3e8fb0ef6fb6/public/static/img/logo/gms.svg",
    "quote": "<div><em>From Secrecy to the light, GES:<br>Experimentation for the next Generation.</em></div>",
    "description": "<div>GES is the Experimental wing of GMS and the Union<br><br>Currently, They are working on Next Generation Mechanized frames.</div>"
  }
]